import Black from "../../src/img/blackwidow.png";
import Cruella from "../../src/img/cruella.png";
import Combat from "../../src/img/combat.jpg";
import Venom from "../../src/img/venom.png";
import Tor from "../../src/img/tor.jpg";
import Squad from "../../src/img/squad.jpg";
import Moon from "../../src/img/moonlight.png";
import Aladin from "../../src/img/aladin.png";
import Joker from "../../src/img/joker.png";
import Bodyguard from "../../src/img/bodyguard.png";

export const movieData = [
    {
        src: Black,
        tags: ["3D", "16+"],
        title: "Чорна Вдова",
        genre: "Фантастика, Екшн, Бойовик",
        previews: [
            {
                href: "/",
                time: "10:30",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "12:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:40",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "19:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 4.5,
        datesShow: [
            [10, 9],
            [11, 9],
            [12, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "1",
        id: 1
    },
    {
        src: Cruella,
        tags: ["2D", "12+"],
        title: "Круелла",
        genre: "Комедія, Кримінал",
        previews: [
            {
                href: "/",
                time: "11:55",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 5,
        datesShow: [
            [13, 9],
            [14, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "2",
        id: 2
    },
    {
        src: Combat,
        tags: ["3D", "16+"],
        title: "Мортал Комбат",
        genre: "Фантастика, Пригоди, Бойовик",
        previews: [
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "19:30",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 4,
        datesShow: [
            [10, 9],
            [11, 9],
            [12, 9],
            [13, 9],
            [14, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "3",
        id: 3
    },
    {
        src: Venom,
        tags: ["3D", "18+"],
        title: "Веном 2",
        genre: "Фантастика, Бойовик",
        previews: [
            {
                href: "/",
                time: "11:55",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 4,
        datesShow: [
            [12, 9],
            [13, 9],
            [14, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "4",
        id: 4
    },
    {
        src: Tor,
        tags: ["3D", "12+"],
        title: "Тор: Любов та грім",
        genre: "Комедія, Кримінал",
        previews: [
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 4.5,
        datesShow: [
            [10, 9],
            [11, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "5",
        id: 5
    },
    {
        src: Squad,
        tags: ["3D", "18+"],
        title: "Загін Самовбивць",
        genre: "Комедія, Кримінал",
        previews: [
            {
                href: "/",
                time: "11:55",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "19:00",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 5,
        datesShow: [
            [10, 9],
            [11, 9],
            [12, 9],
            [13, 9],
            [14, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "6",
        id: 6
    },
    {
        src: Moon,
        tags: ["PRESALE", "3D", "18+"],
        title: "Місячне сяйво",
        genre: "Драма",
        previews: [
            {
                href: "/",
                time: "11:55",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "19:00",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 5,
        datesShow: [
            [15, 9],
            [16, 9],
            [17, 9],
            [18, 9],
            [19, 9],
            [20, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "7",
        id: 7
    },
    {
        src: Joker,
        tags: ["PRESALE", "3D", "18+"],
        title: "Джокер",
        genre: "Драма",
        previews: [
            {
                href: "/",
                time: "11:55",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "19:00",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 5,
        datesShow: [
            [13, 9],
            [14, 9],
            [15, 9],
            [16, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "8",
        id: 8
    },
    {
        src: Aladin,
        tags: ["PRESALE", "3D", "18+"],
        title: "Аладдін",
        genre: "Комедія",
        previews: [
            {
                href: "/",
                time: "11:55",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "19:00",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 5,
        datesShow: [
            [15, 9],
            [16, 9],
            [17, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "9",
        id: 9
    },
    {
        src: Bodyguard,
        tags: ["PRESALE", "3D", "18+"],
        title: "Тілоохоронець дружини кілера",
        genre: "Комедія",
        previews: [
            {
                href: "/",
                time: "11:55",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "13:10",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "15:15",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "17:00",
                tooltip: {
                    price: "Від 50 грн",
                    hall: "Червоний зал"
                }
            },
            {
                href: "/",
                time: "19:00",
                tooltip: {
                    price: "Від 70 грн",
                    hall: "Червоний зал"
                }
            }
        ],
        urlTrailer: "#",
        rating: 5,
        datesShow: [
            [15, 9],
            [16, 9],
            [17, 9],
            [18, 9]
        ],
        description: "Наташа Романова, відома як Чорна Вдова, подивиться у вічі темним сторінкам книги свого життя, коли зіткнеться із небезпечною змовою, пов’язаною з власним минулим. Наташу переслідує небезпечна сила, яка ні перед чим не зупиниться на шляху до її знищення. Тепер вона має розібратись і зі своїм шпигунським минулим, і зі стосунками, які зруйнувала ще до того, як приєдналась до Месників",
        awards: ".",
        actors: "Скарлетт Йоханссон, Флоренс Пью , Девід Харбор, О. Т. Фагбенлі, Уільям Хёрт, Рей Уінстон, Рейчел Вайс",
        director: "Кейт Шортланд",
        duration: "1:42",
        country: "USA",
        year: 2021,
        photos: ["#", "#"],
        getDetail: "10",
        id: 10
    }
];